RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32L40x_Firmware_Library/n32l40x_usbfs_driver/inc/usb_regs.h
/*******************************************************************************
 * Macro Name     : USB_ClrEpCtrsRx / USB_ClrEpCtrsTx.
 * Description    : Clears bit CTR_RX / CTR_TX in the endpoint register.
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _ClearEP_CTR_RX(bEpNum) (_SetENDPOINT(bEpNum, _GetENDPOINT(bEpNum) & 0x7FFF & EPREG_MASK))
#define _ClearEP_CTR_TX(bEpNum) (_SetENDPOINT(bEpNum, _GetENDPOINT(bEpNum) & 0xFF7F & EPREG_MASK))

/*******************************************************************************
 * Macro Name     : USB_DattogRx / USB_DattogTx .
 * Description    : Toggles DTOG_RX / DTOG_TX bit in the endpoint register.
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _ToggleDTOG_RX(bEpNum)                                                                                         \
    (_SetENDPOINT(bEpNum, EP_CTRS_RX | EP_CTRS_TX | EP_DATTOG_RX | (_GetENDPOINT(bEpNum) & EPREG_MASK)))
#define _ToggleDTOG_TX(bEpNum)                                                                                         \
    (_SetENDPOINT(bEpNum, EP_CTRS_RX | EP_CTRS_TX | EP_DATTOG_TX | (_GetENDPOINT(bEpNum) & EPREG_MASK)))

/*******************************************************************************
 * Macro Name     : USB_ClrDattogRx / USB_ClrDattogTx.
 * Description    : Clears DTOG_RX / DTOG_TX bit in the endpoint register.
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _ClearDTOG_RX(bEpNum)                                                                                          \
    if ((_GetENDPOINT(bEpNum) & EP_DATTOG_RX) != 0)                                                                    \
    _ToggleDTOG_RX(bEpNum)
#define _ClearDTOG_TX(bEpNum)                                                                                          \
    if ((_GetENDPOINT(bEpNum) & EP_DATTOG_TX) != 0)                                                                    \
    _ToggleDTOG_TX(bEpNum)
/*******************************************************************************
 * Macro Name     : USB_SetEpAddress.
 * Description    : Sets address in an endpoint register.
 * Input          : bEpNum: Endpoint Number.
 *                  bAddr: Address.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPAddress(bEpNum, bAddr)                                                                                   \
    _SetENDPOINT(bEpNum, EP_CTRS_RX | EP_CTRS_TX | (_GetENDPOINT(bEpNum) & EPREG_MASK) | bAddr)

/*******************************************************************************
 * Macro Name     : USB_GetEpAddress.
 * Description    : Gets address in an endpoint register.
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _GetEPAddress(bEpNum) ((uint8_t)(_GetENDPOINT(bEpNum) & EPADDR_FIELD))

#define _pEPTxAddr(bEpNum)  ((uint32_t*)((_GetBTABLE() + bEpNum * 8) * 2 + PMAAddr))
#define _pEPTxCount(bEpNum) ((uint32_t*)((_GetBTABLE() + bEpNum * 8 + 2) * 2 + PMAAddr))
#define _pEPRxAddr(bEpNum)  ((uint32_t*)((_GetBTABLE() + bEpNum * 8 + 4) * 2 + PMAAddr))
#define _pEPRxCount(bEpNum) ((uint32_t*)((_GetBTABLE() + bEpNum * 8 + 6) * 2 + PMAAddr))

/*******************************************************************************
 * Macro Name     : USB_SetEpTxAddr / USB_SetEpRxAddr.
 * Description    : sets address of the tx/rx buffer.
 * Input          : bEpNum: Endpoint Number.
 *                  wAddr: address to be set (must be word aligned).
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPTxAddr(bEpNum, wAddr) (*_pEPTxAddr(bEpNum) = ((wAddr >> 1) << 1))
#define _SetEPRxAddr(bEpNum, wAddr) (*_pEPRxAddr(bEpNum) = ((wAddr >> 1) << 1))

/*******************************************************************************
 * Macro Name     : USB_GetEpTxAddr / USB_GetEpRxAddr.
 * Description    : Gets address of the tx/rx buffer.
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : address of the buffer.
 *******************************************************************************/
#define _GetEPTxAddr(bEpNum) ((uint16_t)*_pEPTxAddr(bEpNum))
#define _GetEPRxAddr(bEpNum) ((uint16_t)*_pEPRxAddr(bEpNum))

/*******************************************************************************
 * Macro Name     : USB_SetEpCntRxReg.
 * Description    : Sets counter of rx buffer with no. of blocks.
 * Input          : pdwReg: pointer to counter.
 *                  wCount: Counter.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _BlocksOf32(dwReg, wCount, wNBlocks)                                                                           \
    {                                                                                                                  \
        wNBlocks = wCount >> 5;                                                                                        \
        if ((wCount & 0x1f) == 0)                                                                                      \
            wNBlocks--;                                                                                                \
        *pdwReg = (uint32_t)((wNBlocks << 10) | 0x8000);                                                               \
    } /* _BlocksOf32 */

#define _BlocksOf2(dwReg, wCount, wNBlocks)                                                                            \
    {                                                                                                                  \
        wNBlocks = wCount >> 1;                                                                                        \
        if ((wCount & 0x1) != 0)                                                                                       \
            wNBlocks++;                                                                                                \
        *pdwReg = (uint32_t)(wNBlocks << 10);                                                                          \
    } /* _BlocksOf2 */

#define _SetEPCountRxReg(dwReg, wCount)                                                                                \
    {                                                                                                                  \
        uint16_t wNBlocks;                                                                                             \
        if (wCount > 62)                                                                                               \
        {                                                                                                              \
            _BlocksOf32(dwReg, wCount, wNBlocks);                                                                      \
        }                                                                                                              \
        else                                                                                                           \
        {                                                                                                              \
            _BlocksOf2(dwReg, wCount, wNBlocks);                                                                       \
        }                                                                                                              \
    } /* _SetEPCountRxReg */

#define _SetEPRxDblBuf0Count(bEpNum, wCount)                                                                           \
    {                                                                                                                  \
        uint32_t* pdwReg = _pEPTxCount(bEpNum);                                                                        \
        _SetEPCountRxReg(pdwReg, wCount);                                                                              \
    }
/*******************************************************************************
 * Macro Name     : USB_SetEpTxCnt / USB_SetEpRxCnt.
 * Description    : sets counter for the tx/rx buffer.
 * Input          : bEpNum: endpoint number.
 *                  wCount: Counter value.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPTxCount(bEpNum, wCount) (*_pEPTxCount(bEpNum) = wCount)
#define _SetEPRxCount(bEpNum, wCount)                                                                                  \
    {                                                                                                                  \
        uint32_t* pdwReg = _pEPRxCount(bEpNum);                                                                        \
        _SetEPCountRxReg(pdwReg, wCount);                                                                              \
    }
/*******************************************************************************
 * Macro Name     : USB_GetEpTxCnt / USB_GetEpRxCnt.
 * Description    : gets counter of the tx buffer.
 * Input          : bEpNum: endpoint number.
 * Output         : None.
 * Return         : Counter value.
 *******************************************************************************/
#define _GetEPTxCount(bEpNum) ((uint16_t)(*_pEPTxCount(bEpNum)) & 0x3ff)
#define _GetEPRxCount(bEpNum) ((uint16_t)(*_pEPRxCount(bEpNum)) & 0x3ff)

